tap "homebrew/bundle"
tap "homebrew/services"
brew "bat"
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "eza"
brew "fastapi"
brew "fastfetch"
brew "fd"
brew "fnm"
brew "fzf"
brew "lazydocker"
brew "lazygit", link: false
brew "libmagic"
brew "maven"
brew "neovim"
brew "node"
brew "pipx"
brew "powerlevel10k"
brew "pyenv"
brew "ripgrep"
brew "starship"
brew "stow"
brew "superfile"
brew "tmux"
brew "uv"
brew "wgcf"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "anydesk"
cask "arc"
cask "cursor"
cask "discord"
cask "evkey"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "hiddenbar"
cask "hoppscotch"
cask "karabiner-elements"
cask "keeweb"
cask "keka"
cask "kekaexternalhelper"
cask "maccy"
cask "mate-translate"
cask "notion"
cask "notion-calendar"
cask "oracle-jdk"
cask "pearcleaner"
cask "qbittorrent"
cask "sublime-text"
cask "termius"
cask "visual-studio-code"
cask "warp"
cask "wezterm"
cask "windows-app"
cask "zalo"
cask "zed"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "batisteo.vscode-django"
vscode "christian-kohler.path-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.jquerysnippets"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mathematic.vscode-pdf"
vscode "miguelsolorio.symbols"
vscode "mikestead.dotenv"
vscode "monicaim.monica-code"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-typescript-next"
vscode "njpwerner.autodocstring"
vscode "pmneo.tsimporter"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "saoudrizwan.claude-dev"
vscode "streetsidesoftware.code-spell-checker"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-initializr"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
