# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Implementation of the file(1) command
brew "libmagic"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn", restart_service: :changed
# Theme for zsh
brew "powerlevel10k"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# AI Coding Agent IDE
cask "antigravity"
# Allows connection to a computer remotely
cask "anydesk"
# Chromium based browser
cask "arc"
# Desktop password and login vault
cask "bitwarden"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# Flip clock screensaver
cask "fliqlo"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Utility to hide menu bar items
cask "hiddenbar"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Helper application for the Keka file archiver
cask "kekaexternalhelper"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Clipboard manager
cask "maccy"
# Select text in any app and translate it
cask "mate-translate"
# Vietnamese input system
cask "openkey"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Collaboration platform for API development
cask "postman"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Music streaming service
cask "spotify"
# Open-source media center
cask "stremio"
# Text editor for code, markup and prose
cask "sublime-text"
# Desktop client for Telegram messenger
cask "telegram-desktop"
# SSH client
cask "termius"
# Open-source code editor
cask "visual-studio-code"
